Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Joining Streams on Time
zh_cn: 基于时间的双流Join

source: Joining Streams on Time | 145
zh_cn: 基于时间的双流Join | 145

source: Joining two windowed streams
zh_cn: 对划分窗口后的两条流进行Join

source: Joint processing of two streams usually requires that events of both streams are deter‐ ministically routed based on some condition to be processed by the same parallel
zh_cn: 对双流进行Join的场景通常需要对两条流中的事件基于某些条件进行确定性路由，以便它们能够发往算子的同一并行实例上处理。

source: Just about every nontrivial streaming application is stateful.
zh_cn: 几乎所有复杂一点的流式应用都是状态化的。

source: Just like in many other distributed systems, the performance of a Flink application depends a lot on how the tasks are scheduled.
zh_cn: 和很多其他分布式系统一样，Flink应用的性能在很大程度上取决于任务的调度方式。

source: Just like many DataStream applications, the source, sink, and opera‐ tors of the program are assembled in the main() method of the AverageSensorRead ings class.
zh_cn: 和大多数DataStream应用一样，该程序的数据源、数据汇以及其他算子都是在AverageSensorReadings类的main()方法中进行组装的，

source: Just like the rich variants of processing functions,6 subclasses of RichSourceFunction and RichParallelSourceFunction can override the open() and close() methods and access a RuntimeContext that provides the number of parallel task instances and the index of the current instance, among other things.
zh_cn: 就像一系列处理函数的变种一样，RichSourceFunction和RichParallelSourceFunction允许它们的子类覆盖open()和close()方法，并提供RuntimeContext用以访问当前并行任务实例的数量以及当前实例的索引号等信息。

source: Kafka 0.11 introduced support for transactional writes.
zh_cn: Kafka从0.11版本开始支持事务性写。

source: Kafka guards against this by rejecting and closing transactions after a
zh_cn: Kafka通过在一定时间间隔后（可以通过transaction.timeout.ms属性进行配置）拒绝并关闭事务来防止这种情况发生。

source: Kafka messages are stored as raw byte messages and need to be deserialized into Java or Scala objects.
zh_cn: Kafka中的消息是以原始字节的方式存储，因此需要被反序列化成Java或Scala对象。

source: Kafka organizes event streams as so-called topics.
zh_cn: Kafka将事件流组织为不同的主题（topic）。

source: Kafka producer implements the TwoPhaseCommitSinkFunction interface.
zh_cn: 举例而言，Flink的Kafka生产者实现就继承了TwoPhaseCommitSinkFunction类。

source: Keep in mind that some resource managers, such as YARN, will immediately kill a container if it exceeds its memory budget.
zh_cn: 最后请谨记，某些资源管理器（如YARN）会在容器超过内存限制时立即将其终止。

source: Key Selectors
zh_cn: 键值选择器

source: Key groups are discussed in Chapter 3.
zh_cn: 键值组的相关内容已经在第3章讨论过。

source: Keyed State
zh_cn: 键值分区状态

source: Keyed state can only be used by functions that are applied on a KeyedStream.
zh_cn: 键值分区状态只能由作用在KeyedStream上面的函数使用。

source: Keyed state is maintained and accessed with respect to a key defined in the records of an operator’s input stream.
zh_cn: 键值分区状态会按照算子输入记录所定义的键值来进行维护或访问。

source: KeyedProcessFunction holds the timestamps of all timers in a priority queue on the
zh_cn: 默认情况下，KeyedProcessFunction会将全部计时器的时间戳放到堆中的一个优先队列里。

source: KeyedSerializationSchema also exposes more Kafka-specific functionality, such as overriding the target topic to write to multiple topics.
zh_cn: 此外，KeyedSerializationSchema还支持其他一些Kafka特定的功能，例如覆盖目标主题配置、将记录写入多个主题。

source: KeyedStateFunction to the value of each key in the keyed state ref‐ erenced by the StateDescriptor.
zh_cn: 可以对StateDescriptor所引用的键值分区状态内每个键值所对应的状态值应用KeyedStateFunction。

source: KeyedStream Transformations
zh_cn: 基于KeyedStream的转换

source: KeyedStream transformations are transformations that are applied to events in the context of a key.
zh_cn: 作用于同一键值上下文内事件的KeyedStream转换。

source: Keytabs are the preferred approach because tokens expire after some time, which can cause problems for long-running stream processing appli‐ cations.
zh_cn: 其中Keytabs应该是首选方法，因为令牌会在一段时间后过期，这可能会为长时间运行的流处理应用带来问题。

source: Kubernetes also supports pods consisting of multiple tightly linked containers.
zh_cn: Kubernetes还支持由多个紧密相连的容器组成的Pod。

source: Kubernetes can also take care of opening net‐ work ports for internal and external communication and can provide services for process discovery and load balancing.
zh_cn: Kubernetes还负责为内外网络通信打开端口，并可以提供进程发现及负载均衡服务。

source: Kubernetes is an open source platform that enables users to deploy and scale contain‐ erized applications in a distributed environment.
zh_cn: Kubernetes是一个开源平台，它允许用户在分布式环境下部署容器化应用，并对其进行扩缩容。

source: Kubernetes is designed for cluster operations.
zh_cn: 虽然Kubernetes是为操纵集群而设计的，

source: Kubernetes may run a pod anywhere on its cluster.
zh_cn: Kubernetes可能会在其集群的任意位置运行Pod。

source: Kubernetes runs on-premise, in cloud environ‐ ments, or on hybrid infrastructure.
zh_cn: 它能够运行在内部部署（on-premise）、云环境或混合基础架构之上。

source: Kubernetes will run the requested number of containers anywhere on its resources and restart them in the case of a failure.
zh_cn: Kubernetes会利用任意位置的资源运行所需数量的容器，并在出现故障时重启它们。

source: Kuber‐ netes ensures the requested number of pods is continuously running, and auto‐ matically restarts failed pods.
zh_cn: Kubernetes能够确保所需数目的Pod可以持续运行，并在故障时自动重启。

source: Kuber‐ netes provides services to overcome the issue.
zh_cn: 为此，Kubernetes提供了Service。

source: Lambda Functions
zh_cn: Lambda函数

source: Lambda functions are avail‐ able for Scala and Java and offer a simple and concise way to implement application logic when no advanced operations such as accessing state and configuration are required.
zh_cn: Lambda函数可用于Scala或Java，它在不需要进行高级操作（如访问状态或配置）的情况下提供了一种简洁明了的方式来实现应用逻辑。

source: Last but not least, Flink is also a full-fledged batch processor.1
zh_cn: 最后要强调的一点：Flink同时也是一个成熟的批处理引擎。1

source: Last but not least, Flink is also a full-fledged batch processor1.
zh_cn: 最后要强调的一点，Flink同时也是一个成熟的批处理引擎。

source: Late events arrive at an operator after a computation to which they should have con‐ tributed was completed.
zh_cn: 迟到事件抵达算子后，它们本应参与贡献的计算可能已经执行完毕。

source: Late events can also be redirected into another DataStream using the side-output fea‐ ture.
zh_cn: 我们还能利用副输出将迟到事件重定向到另一个DataStream，

source: Late events can be redirected into a separate stream.
zh_cn: 将迟到事件重定向到单独的数据流中。

source: Late events can be simply dropped.
zh_cn: 简单地将其丢弃。

source: Latency
zh_cn: 延迟

source: Latency Versus Throughput
zh_cn: 延迟 vs. 吞吐

source: Latency and Throughput
zh_cn: 延迟和吞吐

source: Latency and throughput
zh_cn: 延迟和吞吐

source: Latency indicates how long it takes for an event to be processed.
zh_cn: 延迟表示处理一个事件所需的时间。

source: Latency is probably one of the first metrics you want to monitor to assess the perfor‐ mance characteristics of your streaming job.
zh_cn: 延迟可能是你用于评估流式作业性能的首要指标之一。

source: Latency markers use the same dataflow channels and queues as normal stream records, thus their tracked latency reflects the time records wait to be processed.
zh_cn: 延迟标记和普通流记录共享Dataflow通道和队列，因此它们所追踪的延迟能够反映出记录等待处理的时间。

source: Latency vs. throughput
zh_cn: 延迟 vs. 吞吐

source: Layered APIs with varying tradeoffs for expressiveness and ease of use.
zh_cn: 层次化的API在表达能力和易用性方面各有权衡。

source: Let us revisit the coffee shop example to clarify how latency and throughput affect each other.
zh_cn: 我们再通过咖啡店的示例来解释一下延迟和吞吐如何相互影响。

source: Let’s assume you want to compute
zh_cn: 假如你想持续计算结果，比如每分钟计算一次。

source: Let’s assume you want to compute results continuously, for example every one minute.
zh_cn: 假设你想持续计算结果，比如每分钟计算一次。

source: Let’s look at each type category.
zh_cn: 我们分别来看一下每种类型。

source: Let’s now explain in more detail how a task emits watermarks and updates its event- time clock when receiving a new watermark.
zh_cn: 接下来我们详细解释一下任务在收到一个新的水位线之后，将如何发送水位线和更新其内部事件时间时钟。

source: Let’s revisit the coffee shop example to clarify how latency and throughput affect each other.
zh_cn: 我们再通过咖啡店的例子来解释一下延迟和吞吐如何相互影响。

source: Let’s start with a simple example to get a first impression of what it is like to write streaming applications with the DataStream API.
zh_cn: 让我们从一个简单的示例开始，体验一下使用DataStream API编写流式应用的感觉。

source: Let’s summarize the requirements for the external sink system:
zh_cn: 下面我们来总结一下对于外部数据汇系统的要求：

source: Library style
zh_cn: 库模式

source: Library style: In this mode, the Flink application is bundled in an application-specific container image, such as a Docker image.
zh_cn: 库模式：在该模式下，Flink应用会绑定到一个应用相关的容器映像中（如Docker映像）。

source: Like the filesystem source connector, Flink’s StreamingFileSink connector is con‐ tained in the flink-streaming-java module.
zh_cn: 和文件系统数据源连接器类似，Flink的StreamingFileSink连接器也是包含在flink-streaming-java模块中。

source: List of available metrics reporters
zh_cn: 指标汇报器列表

source: List state
zh_cn: 列表状态（list state）

source: ListCheckpointed Interface Uses Java Serialization
zh_cn: ListCheckpointed接口使用了Java序列化机制

source: ListState[T] holds a list of elements of type T. New elements can be appended to the list by calling ListState.add(value: T) or ListState.addAll(values: java.util.List[T]).
zh_cn: ListState[T]用于保存类型为T的元素列表。你可以调用ListState.add(value: T)或ListState.addAll(values: java.util.List[T])将新元素附加到列表中,

source: ListState[X] has an advantage over Value State[List[X]] if elements are frequently appended to the list and the elements of the list are less frequently accessed.
zh_cn: 如果经常要在列表后面添加元素且列表元素的访问频率很低，那么ListState[X]会比ValueState[List[X]]更有优势。

source: Listing running applications
zh_cn: 列出正在运行的应用

source: Local filesystem
zh_cn: 本地文件系统

source: Local filesystems are referenced by the file:// URI scheme.
zh_cn: 本地文件系统的URI协议是file://。

source: Local recovery
zh_cn: 本地恢复

source: Local recovery can be enabled and configured for a cluster in the flink-conf.yaml file or per application by including the following in the state backend configuration:
zh_cn: 你可以通过在flink-conf.yaml文件中加入以下内容为集群开启和配置本地恢复，也可以在状态后端配置中加入以下内容为每个应用单独开启和配置本地恢复：

source: Local recovery is implemented so that the state copy in the remote system is the source of truth.
zh_cn: 本地恢复的实现使得远程系统中的状态副本成为用于参照的真实数据（the source of truth）。

source: Local recovery only affects keyed state, which is always partitioned and usually accounts for most of the state size.
zh_cn: 本地恢复只会影响键值分区状态，此类状态总是会被分区且通常在状态中占据的比例非常高。

source: Local state access provides very good performance compared to reading and writing queries against remote datastores.
zh_cn: 访问本地状态的性能要比读写远程数据存储系统更好；

source: Local state accesses, i.e., reading from or writing to memory or local disk, provide very good performance compared to read and write queries against remote data stores.
zh_cn: 只需要访问本地状态。和查询远程数据存储系统相比，读写本地内存或磁盘性能会更好。

source: Logging is another essential tool for debugging and understanding the behavior of your applications.
zh_cn: 日志是你调试和理解应用行为的另一个重要工具。

source: Looking again at the HighTempCounter function in Example 7-4, we see that each par‐ allel instance of the operator exposes its state as a list with a single entry.
zh_cn: 回顾一下示例7-4中的HighTempCounter函数，每个算子并行实例所提供的状态列表都只包含了一个项目。

source: Looking at the example, you might wonder why operator state is handled as a list of state objects.
zh_cn: 看完上述例子，你可能会好奇为什么要将算子状态作为状态对象列表来处理？

source: Low latency is a key characteristic of stream processing and it enables what we call real-time applications.
zh_cn: 低延迟是流处理的一个关键特性，它滋生了所谓的实时应用。

source: Mailing lists
zh_cn: 邮件列表

source: Main Memory and Network Buffers
zh_cn: 内存和网络缓冲

source: Make sure that “Import project from external model” and “Maven” are selected and click Next.
zh_cn: 确保勾上"Import project from external model"以及"Maven"两个选项，然后点击Next。

source: Make sure to disable this behavior or configure a differ‐ ent directory if you plan to run continuous Flink applications.
zh_cn: 如果你的应用需要长时间地持续运行，请确保上述行为已被禁用或选择一个其他目录。

source: Manager is passed to the containers via the JOB_MANAGER_RPC_ADDRESS variable,
zh_cn: Docker内部JobManager的主机名会通过JOB_MANAGER_RPC_ADDRESS变量传给容器，

source: Managing Applications with the Command-Line Client
zh_cn: 通过命令行客户端管理应用

source: Managing Applications with the REST API
zh_cn: 通过REST API管理应用

source: Managing and monitoring a Flink cluster
zh_cn: 管理和监控Flink集群

source: Managing and montioring Flink applications
zh_cn: 管理和监控Flink应用

source: Many applications ingest multiple streams that need to be jointly processed or split a stream in order to apply different logic to different substreams.
zh_cn: 很多应用需要将多条输入流联合起来处理，或将一条流分割成多条子流以应用不同逻辑。

source: Many changes will not be possible if the original version was not designed with updates in mind.
zh_cn: 如果原始版本在设计时没有考虑到日后的更新，则很难对其进行较大改动。

source: Many operators continuously read and update some kind of state such as records collected in a window, reading positions of an input source, or custom, application-specific operator states like machine learning models.
zh_cn: 很多算子都会不断地读取并更新某些状态，例如：窗口内收集的记录，输入源的读取位置或是一些定制的，诸如机器学习模型之类的特定应用状态。

source: Many people show up at the same time and have to wait in line.
zh_cn: 店内突然间涌入大量顾客，点单的人排起了长队。

source: Many people show up at the same time and you have to wait in line to place your order.
zh_cn: 突然间涌入大量顾客，你必须排队点单。

source: Many problems originate from incompatibili‐ ties among different versions of the same library that are pulled in from different connectors or directly from the user application.
zh_cn: 连接器或用户程序使用的类库一多就容易出现使用了同一库的多个版本，很多问题都是源于这些版本之间相互不兼容。

source: Many stream processing applications need to share their results with other applica‐ tions.
zh_cn: 很多处理应用需要将它们的结果与其他应用分享。

source: Map state
zh_cn: 映射状态（map state）

source: MapFunction in the following, are defined as classes that implement a
zh_cn: 函数可以通过实现某个特定转换的接口类来定义，例如下面的MapFunction：

source: MapState[K, V] holds a map of keys and values.
zh_cn: MapState[K, V]用于保存一组键到值的映射。

source: Master and worker containers are started from the same Docker image with different parameters as shown in Example 9-1.
zh_cn: 如示例9-1所示，主容器和工作容器可以从同一个Docker镜像启动，只不过二者的参数不同。

source: Meetups and conferences
zh_cn: 聚会及会议

source: Members of the Flink community configure and build Docker images for Apache Flink and upload them to Docker Hub, a public repository for Docker images.2 The repository hosts Docker images for the most recent Flink versions.
zh_cn: Flink社区成员已经为Apache Flink配置和构建了Docker镜像，并把它们上传到了Docker Hub（一个用于存放Docker镜像的公共仓库）上面。仓库内包含了Flink最近几个版本的Docker镜像。

source: MemoryStateBackend does not require any parameters.
zh_cn: MemoryStateBackend无需任何参数。

source: MemoryStateBackend stores state as regular objects on the heap of the TaskMan‐ ager JVM process.
zh_cn: MemoryStateBackend将状态以常规对象的方式存储在TaskManager进程的JVM堆里。

source: Merging of windows is discussed in more detail in the next section.
zh_cn: 有关窗口合并的内容会在下一节详细讨论。

source: Message queues and event logs, such as Apache Kafka, Kinesis, or RabbitMQ, are common sources to ingest data streams.
zh_cn: 消息队列（例如Apache Kafka、Kinesis或RabbitMQ）是一类常见的数据流消息来源。

source: Metric System
zh_cn: 指标系统

source: Metric groups
zh_cn: 指标组

source: Metric reporters will turn the Gauge value into a String, so make sure you provide a meaningful toString() implementation if it is not provided by the type you use.
zh_cn: 指标报告器会将Gauge值转换为String，因此如果你用到的类型没有提供有意义的toString()实现，请将它加上。

source: Metrics Reported as Strings
zh_cn: 指标是作为字符串对外报告

source: Metrics are gathered per operator, TaskManager, or JobManager.
zh_cn: 指标的收集时按照每个算子、每个TaskManager或JobManager来进行的。

source: Metrics are ref‐ erenced by a unique identifier that contains up to three parts:
zh_cn: 用于引用指标的唯一标识最多包含三个部分：

source: Metrics can be scoped to the JobManager, a TaskManager, a job, an operator, or a task.
zh_cn: 它的范围可以是JobManager、某个TaskManager、某个作业、某个算子或任务。

source: Metzger, Sebastian Schelter, Shaoxuan Wang, Shuyi Chen, Stefan Richter, Stephan Ewen, Theodore Vasiloudis, Thomas Weise, Till Rohrmann, Timo Walther, Tzu-Li (Gordon) Tai, Ufuk Celebi, Xiaogang Shi, Xiaowei Jiang, Xingcan Cui.
zh_cn: Metzger、Sebastian Schelter、Shaoxuan Wang（王绍翾）、Shuyi Chen（陈舒毅）、Stefan Richter、Stephan Ewen、Theodore Vasiloudis、Thomas Weise、 Till Rohrmann、Timo Walther、Tzu-Li (Gordon) Tai（戴资力）、Ufuk Celebi、Xiaogang Shi（施晓罡）、Xiaowei Jiang（蒋晓伟）、Xingcan Cui（崔星灿）。

source: Microservices and all required software and services are typically bundled and deployed in independent containers.
zh_cn: 通常，微服务连同必须的软件及服务会打包部署到独立的容器中。

source: Microservices are designed as small, self-contained, and independent applications.
zh_cn: 微服务由很多微型、完备、独立的应用组成，

source: Microser‐ vices and all the required software and services are typically bundled and deployed in independent containers.
zh_cn: 通常情况下，微服务会和所有必须的软件及服务一起打包部署到独立的容器中。

source: Millisecond latencies while processing millions of events per second.
zh_cn: 在每秒处理数百万条事件的同时保持毫秒级延迟。

source: Minikube needs to be running.
zh_cn: 但前提是Minikube需要处在运行状态。

source: Modern stream processors, like Apache Flink, can offer latencies as low as a few milliseconds.
zh_cn: 像Apache Flink这样的现代流处理引擎可以提供低至几毫秒的延迟。

source: Modified applica‐ tions can also be used to run A/B tests or what-if scenarios with different busi‐ ness logic.
zh_cn: 应用修改还可用于A/B测试或需要不同业务逻辑的假想场景。

source: Modifying the State of an Operator
zh_cn: 修改算子的状态

source: Modifying the state of an existing operator by changing the state primitive or data type of the state.
zh_cn: 通过改变状态原语或数据类型来修改已有算子的状态。

source: Monitoring Flink Clusters and Applications
zh_cn: 监控Flink集群及应用

source: Monitoring Flink Clusters and Applications | 271
zh_cn: 监控Flink集群及应用 | 271

source: Monitoring Flink Clusters and Applications | 273
zh_cn: 监控Flink集群及应用 | 273

source: Monitoring Latency
zh_cn: 延迟监控

source: Monitoring ingested files by tracking the modification timestamp also has implications if you read from file stores with eventually consistent list operations, such as S3.
zh_cn: 如果要从列表操作具有最终一致性的文件存储中（如S3）读取数据，则通过跟踪修改时间来监视要读取的文件同样会有影响。

source: Monitoring the quality of cellphone networks
zh_cn: 手机网络质量监控

source: Monitoring the quality of cellphone networks.
zh_cn: 手机网络质量监控，

source: Monitoring your streaming job is essential to ensure its healthy operation and to detect potential symptoms of misconfigurations, underprovisioning, or unexpected behavior early.
zh_cn: 监控流式作业对于保证它的健康运行和尽早发现由于配置错误、资源不足或其他异常行为所导致的潜在症状十分关键。

source: More complex applications are built by connecting several microservices with each other that only communicate over stand‐ ardized interfaces such as RESTful HTTP connections.
zh_cn: 通过将多个微服务相互连接可以构建出更加复杂的应用，而微服务之间只通过标准化接口（如RESTful HTTP连接）进行通信。

source: More complex applica‐ tions are built by connecting several microservices with each other that only commu‐ nicate over standardized interfaces such as RESTful HTTP connections.
zh_cn: 通过将多个微服务相互连接可以构建出更加复杂的应用，而微服务间只会通过标准化接口（如RESTful HTTP连接）进行通信。

source: Moreover the state size typically increases because the application needs to buffer more data until it can perform a computation.
zh_cn: 此外，由于应用需要在计算之前缓冲更多的数据，所以通常会导致状态大小也随之增加。

source: Moreover, each parallel instance chunks its output into multiple part files.
zh_cn: 每个并行实例会把自己的输出写到多个分块文件中。

source: Moreover, you can enable asynchronous checkpointing (state.backend.async) and incremental checkpointing (state.backend.incremen tal).
zh_cn: 此外，还可以启用异步检查点（state.backend.async）和增量检查点（state.backend.incremental）。

source: Moreover, AsyncFunction properly works with event-time pro‐
zh_cn: 此外，AsyncFunction可以在事件时间处理模式下正确地工作，

source: Moreover, Flink provides Maven archetypes to bootstrap new Flink Maven projects.
zh_cn: 此外，Flink还提供了用于创建Flink Maven新项目的Maven模板（maven archetypes）。

source: Moreover, FlinkKafkaProducer pro‐ vides a constructor with a Semantic parameter that controls the consistency guarantees provided by the sink.
zh_cn: 此外，FlinkKafkaProducer还提供了一个带有Semantic参数的构造函数，用来控制数据汇提供的一致性保障。

source: Moreover, Kryo does not provide a good migration path to evolve data types.
zh_cn: 此外，对于数据类型发生改变的情况，Kryo没有提供很好的迁移路径。

source: Moreover, a 2PC sink continuously writes records to the sink system compared to the spiky writing pattern of a WAL sink.
zh_cn: 此外，2PC数据汇可以持续平稳地将记录写入接收系统，而不会像WAL数据汇那样经历周期性的"波峰式"写入。

source: Moreover, checkpoints are automatically deleted when an application is canceled, unless the application explicitly enabled checkpoint retention.
zh_cn: 此外，除非应用显式指定要保留检查点，否则它们会在应用取消时自动被删除。

source: Moreover, even though events were not lost, they could be processed more than once.
zh_cn: 此外，虽然数据在出错时不会丢失，但可能会被处理多次。

source: Moreover, even though events would not be lost in case of a failure, they could be processed more than once.
zh_cn: 此外，虽然数据在出错时不会丢失，但可能会被处理多次。

source: Moreover, exactly-once state consistency and the ability to scale an application are fundamental requirements.
zh_cn: 此外，作为基本需求，系统要提供精确一次的状态一致性保障和应用扩容能力。

source: Moreover, in the case of a failure, a stateless operator can be simply restarted and continue processing from where it left off.
zh_cn: 此外，如果发生故障，无状态的算子可以很容易地重启，并从中断处继续工作。

source: Moreover, it is an effective mecha‐ nism to distribute network resources in case of skewed data distributions because credit is granted depending on the size of the senders’ backlog.
zh_cn: 此外，授予信用度是依据发送端的积压量来完成，因此该机制还会在出现数据倾斜时有效地分配网络资源。

source: Moreover, it is an effective mechanism to distribute network resources in the case of skewed data distributions because credit is granted based on the size of the senders’ backlog.
zh_cn: 此外，信用值的授予是根据各发送端的数据积压量来完成的，因此该机制还能在出现数据倾斜（data skew）时有效地分配网络资源。

source: Moreover, it is common to organize records into so-called buckets, so that consuming applica‐ tions have more control over which data to read.
zh_cn: 此外，我们还经常会将记录组织到不同的桶中，以便消费应用更好地控制要读取的数据。

source: Moreover, it is often required to transform the data into a common format.
zh_cn: 此外，我们经常需要将数据转换为某种通用格式。

source: Moreover, it provides type information for Scala’s Either, Option, and Try types, and Flink’s Java version of the Either type.
zh_cn: 此外，它还为Scala的Either、Option、Try类型以及Flink内部Java版本的Either类型提供了相应的类型信息。

source: Moreover, local recovery is not supported by the MemorySta teBackend, which does not support large state anyway.
zh_cn: 此外，不支持大状态的MemoryStateBackend无法进行本地恢复。

source: Moreover, most Flink applications depend on one or more of Flink’s connectors to ingest data from or emit data to external sys‐ tems, like Apache Kafka, filesystems, or Apache Cassandra.
zh_cn: 此外，大多数Flink应用都会依赖一个或多个Flink的连接器来读写外部系统（例如：Apache Kafka、文件系统或Apache Cassandra）。

source: Moreover, on recovery, it might be possible to restart an application on the same workers it was running before the failure.
zh_cn: 此外，恢复时还可能让应用重新运行在故障发生之前的工作节点上。

source: Moreover, process functions feature side outputs to emit records to multiple output streams.
zh_cn: 此外，处理函数的副输出功能还允许将记录发送到多个输出流中。

source: Moreover, results were still dependent on timing and order of arriving events, i.e., the results did not depend solely on the data but also on exter‐ nal conditions such as the hardware utilization.
zh_cn: 此外，结果仍然依赖于到来事件的时间和顺序，换言之，结果的生成不仅依赖于数据本身，还和外部条件（如：硬件使用率）有关。

source: Moreover, results were still dependent on timing and order of arriving events.
zh_cn: 并且其处理结果仍依赖于事件到来的时间和顺序。

source: Moreover, the Context can emit records to side outputs.
zh_cn: 此外，Context还支持将结果发送到副输出。

source: Moreover, the deployment also opens a few ports and passes the service name of the
zh_cn: 此外，该Deployment也会开启几个端口，并传入Flink主进程Deployment的信息，以便工作进程对主进程进行访问。

source: Moreover, the method has a Context parameter similar to other process methods.
zh_cn: 此外，该方法和其他处理方法一样都有一个Context参数。

source: Moreover, the protocol of TwoPhaseCommitSinkFunction piggybacks on Flink’s regular checkpointing mechanism and thus adds little overhead.
zh_cn: 再加上TwoPhaseCommitSinkFunction的协议本就是建立在Flink常规的检查点机制之上，因此它并没有带来很多额外开销。

source: Moreover, the size of the state can grow and shrink over time, perhaps due to long-running win‐ dows.
zh_cn: 此外，状态大小可能会随时间推移而增大或缩小，这可能是长期运行的窗口所致。

source: Moreover, the state of a window operator with an AggregateFunction also consists of a single value.
zh_cn: 此外，使用了AggregateFunction的窗口算子，其状态也只有一个值。

source: Moreover, the stream processor can recover from failures with exactly-once state consistency guarantees and can adjust the compute resources of an application.
zh_cn: 此外，它还能以精确一次的状态一致性保障进行故障恢复，调节应用计算资源等。
